# API

### API(Application Programming Interface, 응용 프로그램 프로그래밍 인터페이스)는 응용 프로그램에서 사용할 수 있도록, 운영 체제나 프로그래밍 언어가 제공하는 기능을 제어할 수 있게 만든 인터페이스를 뜻한다.

어떠한 응용프로그램에서 데이터를 주고 받기 위한 방법을 뜻한다.

 API는 프로그램과 프로그램을 연결하는 일종의 다리와 같다. **API가 대신해주는 프로그램의 기능들을 미리 정리해서 규칙을 잘 세워두면 클라이언트는 접근할 프로그램을 모르더라도 API에 따라 손쉽게 통신을 할 수 있게 됩니다.** 

- API 사용 사례
    - 날씨 데이터같은 공공 데이터를 쉽게 접근 할 수있도록 기상청API를 제공한다.
    - 공공API를 가져와 미세먼지 농도를 알려주는 앱을 만든다.
    
    API 문서
    

![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/ec3876c1-bf67-4130-b2ee-2a3791d80f34/Untitled.png)

예시로 카카오에서 제공하는 로그인 API를 클라이언트에서 들이 카카오서버 개발자가 만든 API서버를 사용한다.

**이** **때 카카오 로그인 API 문서를 보면 어디(url)에 무엇을(Parameter)을 보내면 무슨 응답(Response)을 줄지가 전부 약속되어 있는 것을 확인할 수 있습니다.**
